import cv2 #(1) => فرابخونیم تا بتونیم از قابلیت های که داره استفادهکنیم cv2 اول باید
from cvzone.HandTrackingModule import HandDetector #(2) =>برای اینکه از یه پکیج استفاده 
# کنیم که بتونه دست و تشخیص بده از این کد میزنیم

cap = cv2.VideoCapture(0) # (3) => اینجا یه متغیر درست میکنیم تا تعیین کنیم از ویدیو 
# می خواهیم استفاده کنیم یا عکس 
detector = HandDetector() # (4) => اینجا ما از این کد برای تشخیص دست استفاده میکنیم

while True: # (5) => حالا یه حلقه درست میکنم تا عملکرد های که میخواهیم
# تعیین کنیم  تو ویدیو انجام بشه 
    surccrs, img = cap.read() # (6) => حالا با استفاده از این کد برای خوندن ویدیو ای که 
    # خواستیم میخونیم و ازش استفاده میکنیم
    hands, img = detector.findHands(img) # (7) => اینجا ما تعیین میکنیم که هر دستی دیدی
    # باانگشت ها دست به ما نمایش بده 
    cv2.waitKey(1) # (8) => حالا این کد های پایانی میزنیم برای کارکردن کدها
    cv2.imshow("Images", img) # اینجا هم برای صفحه ای که باز میشه میتونیم اسم بزاریم